# parameters
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

#  - [[10,13,0.1666], [10,13,0.5], [10,13,0.8333], [16,30,0.1666], [16,30,0.5], [16,30,0.8333], [33,23,0.1666], [33,23,0.5], [33,23,0.8333]]  # P3/8
#  - [[30,61,0.1666], [30,61,0.5], [30,61,0.8333], [62,45,0.1666], [62,45,0.5], [62,45,0.8333], [59,119,0.1666], [59,119,0.5], [59,119,0.8333]]  # P4/16
#  - [[116,90,0.1666], [116,90,0.5], [116,90,0.8333], [156,198,0.1666], [156,198,0.5], [156,198,0.8333], [373,326,0.1666], [373,326,0.5], [373,326,0.8333]]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   #[-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 8
   [-1, 1, SE, [1024]],  #SE
#   [-1, 1, CA, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 10
#   [-1, 1, SPPD, [1024, 5]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)

   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 24 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

# cls of feature map
Detect:
  Detect